zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_EIM_1.h
/** Number of instances of the EIM_1 module. */
#define EIM_1_INSTANCE_COUNT                     (1u)

/* EIM_1 - Peripheral instance base addresses */
/** Peripheral EIM_1 base address */
#define IP_EIM_1_BASE                            (0x40510000u)
/** Peripheral EIM_1 base pointer */
#define IP_EIM_1                                 ((EIM_1_Type *)IP_EIM_1_BASE)
/** Array initializer of EIM_1 peripheral base addresses */
#define IP_EIM_1_BASE_ADDRS                      { IP_EIM_1_BASE }
/** Array initializer of EIM_1 peripheral base pointers */
#define IP_EIM_1_BASE_PTRS                       { IP_EIM_1 }

/* ----------------------------------------------------------------------------
   -- EIM_1 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EIM_1_Register_Masks EIM_1 Register Masks
 * @{
 */

/*! @name EIMCR - Error Injection Module Configuration Register */
/*! @{ */

#define EIM_1_EIMCR_GEIEN_MASK                   (0x1U)
#define EIM_1_EIMCR_GEIEN_SHIFT                  (0U)
#define EIM_1_EIMCR_GEIEN_WIDTH                  (1U)
#define EIM_1_EIMCR_GEIEN(x)                     (((uint32_t)(((uint32_t)(x)) << EIM_1_EIMCR_GEIEN_SHIFT)) & EIM_1_EIMCR_GEIEN_MASK)
/*! @} */

/*! @name EICHEN - Error Injection Channel Enable register */
/*! @{ */

#define EIM_1_EICHEN_EICH17EN_MASK               (0x4000U)
#define EIM_1_EICHEN_EICH17EN_SHIFT              (14U)
#define EIM_1_EICHEN_EICH17EN_WIDTH              (1U)
#define EIM_1_EICHEN_EICH17EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHEN_EICH17EN_SHIFT)) & EIM_1_EICHEN_EICH17EN_MASK)

#define EIM_1_EICHEN_EICH16EN_MASK               (0x8000U)
#define EIM_1_EICHEN_EICH16EN_SHIFT              (15U)
#define EIM_1_EICHEN_EICH16EN_WIDTH              (1U)
#define EIM_1_EICHEN_EICH16EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHEN_EICH16EN_SHIFT)) & EIM_1_EICHEN_EICH16EN_MASK)

#define EIM_1_EICHEN_EICH12EN_MASK               (0x80000U)
#define EIM_1_EICHEN_EICH12EN_SHIFT              (19U)
#define EIM_1_EICHEN_EICH12EN_WIDTH              (1U)
#define EIM_1_EICHEN_EICH12EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHEN_EICH12EN_SHIFT)) & EIM_1_EICHEN_EICH12EN_MASK)

#define EIM_1_EICHEN_EICH11EN_MASK               (0x100000U)
#define EIM_1_EICHEN_EICH11EN_SHIFT              (20U)
#define EIM_1_EICHEN_EICH11EN_WIDTH              (1U)
#define EIM_1_EICHEN_EICH11EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHEN_EICH11EN_SHIFT)) & EIM_1_EICHEN_EICH11EN_MASK)

#define EIM_1_EICHEN_EICH10EN_MASK               (0x200000U)
#define EIM_1_EICHEN_EICH10EN_SHIFT              (21U)
#define EIM_1_EICHEN_EICH10EN_WIDTH              (1U)
#define EIM_1_EICHEN_EICH10EN(x)                 (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHEN_EICH10EN_SHIFT)) & EIM_1_EICHEN_EICH10EN_MASK)

#define EIM_1_EICHEN_EICH4EN_MASK                (0x8000000U)
#define EIM_1_EICHEN_EICH4EN_SHIFT               (27U)
#define EIM_1_EICHEN_EICH4EN_WIDTH               (1U)
#define EIM_1_EICHEN_EICH4EN(x)                  (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHEN_EICH4EN_SHIFT)) & EIM_1_EICHEN_EICH4EN_MASK)

#define EIM_1_EICHEN_EICH3EN_MASK                (0x10000000U)
#define EIM_1_EICHEN_EICH3EN_SHIFT               (28U)
#define EIM_1_EICHEN_EICH3EN_WIDTH               (1U)
#define EIM_1_EICHEN_EICH3EN(x)                  (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHEN_EICH3EN_SHIFT)) & EIM_1_EICHEN_EICH3EN_MASK)

#define EIM_1_EICHEN_EICH2EN_MASK                (0x20000000U)
#define EIM_1_EICHEN_EICH2EN_SHIFT               (29U)
#define EIM_1_EICHEN_EICH2EN_WIDTH               (1U)
#define EIM_1_EICHEN_EICH2EN(x)                  (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHEN_EICH2EN_SHIFT)) & EIM_1_EICHEN_EICH2EN_MASK)

#define EIM_1_EICHEN_EICH1EN_MASK                (0x40000000U)
#define EIM_1_EICHEN_EICH1EN_SHIFT               (30U)
#define EIM_1_EICHEN_EICH1EN_WIDTH               (1U)
#define EIM_1_EICHEN_EICH1EN(x)                  (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHEN_EICH1EN_SHIFT)) & EIM_1_EICHEN_EICH1EN_MASK)

#define EIM_1_EICHEN_EICH0EN_MASK                (0x80000000U)
#define EIM_1_EICHEN_EICH0EN_SHIFT               (31U)
#define EIM_1_EICHEN_EICH0EN_WIDTH               (1U)
#define EIM_1_EICHEN_EICH0EN(x)                  (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHEN_EICH0EN_SHIFT)) & EIM_1_EICHEN_EICH0EN_MASK)
/*! @} */

/*! @name EICHD0_WORD0 - Error Injection Channel Descriptor 0, Word0 */
/*! @{ */

#define EIM_1_EICHD0_WORD0_CHKBIT_MASK_MASK      (0xFFFC0000U)
#define EIM_1_EICHD0_WORD0_CHKBIT_MASK_SHIFT     (18U)
#define EIM_1_EICHD0_WORD0_CHKBIT_MASK_WIDTH     (14U)
#define EIM_1_EICHD0_WORD0_CHKBIT_MASK(x)        (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD0_WORD0_CHKBIT_MASK_SHIFT)) & EIM_1_EICHD0_WORD0_CHKBIT_MASK_MASK)
/*! @} */

/*! @name EICHD0_WORD1 - Error Injection Channel Descriptor 0, Word1 */
/*! @{ */

#define EIM_1_EICHD0_WORD1_B0_3DATA_MASK_MASK    (0xFFFU)
#define EIM_1_EICHD0_WORD1_B0_3DATA_MASK_SHIFT   (0U)
#define EIM_1_EICHD0_WORD1_B0_3DATA_MASK_WIDTH   (12U)
#define EIM_1_EICHD0_WORD1_B0_3DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD0_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_1_EICHD0_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD0_WORD2 - Error Injection Channel Descriptor 0, Word2 */
/*! @{ */

#define EIM_1_EICHD0_WORD2_B4_7DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_1_EICHD0_WORD2_B4_7DATA_MASK_SHIFT   (0U)
#define EIM_1_EICHD0_WORD2_B4_7DATA_MASK_WIDTH   (32U)
#define EIM_1_EICHD0_WORD2_B4_7DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD0_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_1_EICHD0_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD1_WORD0 - Error Injection Channel Descriptor 1, Word0 */
/*! @{ */

#define EIM_1_EICHD1_WORD0_CHKBIT_MASK_MASK      (0xFFFF0000U)
#define EIM_1_EICHD1_WORD0_CHKBIT_MASK_SHIFT     (16U)
#define EIM_1_EICHD1_WORD0_CHKBIT_MASK_WIDTH     (16U)
#define EIM_1_EICHD1_WORD0_CHKBIT_MASK(x)        (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD1_WORD0_CHKBIT_MASK_SHIFT)) & EIM_1_EICHD1_WORD0_CHKBIT_MASK_MASK)
/*! @} */

/*! @name EICHD1_WORD1 - Error Injection Channel Descriptor 1, Word1 */
/*! @{ */

#define EIM_1_EICHD1_WORD1_B0_3DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_1_EICHD1_WORD1_B0_3DATA_MASK_SHIFT   (0U)
#define EIM_1_EICHD1_WORD1_B0_3DATA_MASK_WIDTH   (32U)
#define EIM_1_EICHD1_WORD1_B0_3DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD1_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_1_EICHD1_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD1_WORD2 - Error Injection Channel Descriptor 1, Word2 */
/*! @{ */

#define EIM_1_EICHD1_WORD2_B4_7DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_1_EICHD1_WORD2_B4_7DATA_MASK_SHIFT   (0U)
#define EIM_1_EICHD1_WORD2_B4_7DATA_MASK_WIDTH   (32U)
#define EIM_1_EICHD1_WORD2_B4_7DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD1_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_1_EICHD1_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD1_WORD3 - Error Injection Channel Descriptor 1, Word3 */
/*! @{ */

#define EIM_1_EICHD1_WORD3_B8_11DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_1_EICHD1_WORD3_B8_11DATA_MASK_SHIFT  (0U)
#define EIM_1_EICHD1_WORD3_B8_11DATA_MASK_WIDTH  (32U)
#define EIM_1_EICHD1_WORD3_B8_11DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_1_EICHD1_WORD3_B8_11DATA_MASK_SHIFT)) & EIM_1_EICHD1_WORD3_B8_11DATA_MASK_MASK)
/*! @} */

/*! @name EICHD1_WORD4 - Error Injection Channel Descriptor 1, Word4 */
/*! @{ */

